#ifndef _MOD_MEDIA_H_
#define _MOD_MEDIA_H_

#ifdef _T49

#include "commondefine.h"
/*******************************************************************
** 函数描述:    初始化
** 参数:        无
** 返回:        无
********************************************************************/
void modmedia_Init();

/*******************************************************************
** 函数描述:    设置布局供通话使用
** 参数:
                [DisplayMonitor] 视频布局
** 返回:        无
********************************************************************/
void modmedia_SetVideoLayout(DisplayMonitor & display);

/*******************************************************************
** 函数描述:    设置布局供通话使用
** 参数:
** 返回:        无
********************************************************************/
void modmedia_SetVideoLayout();

/*******************************************************************
** 函数描述:    打开关闭本地视频，仅供Idle/测试模式控制本地视频使用
** 参数:
** 返回:        无
********************************************************************/
void modmedia_CtrlLocalVideo(DisplayMonitor & display, bool bOpen);

/*******************************************************************
** 函数描述:    录音模块使用控制降低视频编码能力
** 参数:
** 返回:        无
********************************************************************/
void modmedia_ReducePower();

/*******************************************************************
** 函数描述:    录音模块使用控制恢复视频编码完整能力
** 参数:
** 返回:        无
********************************************************************/
void modmedia_ResumePower();

/*******************************************************************
** 函数描述:   UI获取通话情况统计信息
** 参数:
** 返回:        无
********************************************************************/
void modmedia_GetStats(YLList<SessionInfo> & listInfo);

/*******************************************************************
** 函数描述:   UI通过call id获取通话音视频统计信息
** 参数:
** 返回:        无
********************************************************************/
bool modmedia_GetStats(int iCallId, MediaStatsInfo & statsInfo);

/*******************************************************************
** 函数描述:   UI通过call id获取通话对端的视频分辨率
** 参数:
** 返回:        无
********************************************************************/
bool modmedia_GetResolution(int iCallId, VideoSizeInfo & stInfo);

/*******************************************************************
** 函数描述:    设置显示分辨率
** 参数:
            videoDST
            iWidth
            iHeight
            iFps
** 返回:     TRUE:设置成功,FALSE:设置失败
********************************************************************/
bool modmedia_SetDisplay(int iWidth, int iHeight, int iFps, int videoDST = IPVP_VIDEO_DST_HDMI2);

/*******************************************************************
** 函数描述:    建立会议
** 参数:      [in] listCallID：通话ID的列表
** 返回:      无
********************************************************************/
void modmedia_StartConf(const YLList<int> & listCallID);

/*******************************************************************
** 函数描述:  停止会议
** 参数:      [in] listCallID：通话ID的列表
** 返回:      无
********************************************************************/
void modmedia_StopConf(const YLList<int> & listCallID);

#endif //#ifdef _T49
#endif // _MOD_MEDIA_H_
