#ifndef __MOD_LOGIC_UI_MANAGER__
#define __MOD_LOGIC_UI_MANAGER__

/************************************************************************/
/* 接口  ： LogicUIManager_IsTopWndIdle()                               */
/* 功能  ： 初始化判断顶层窗口是不是Idle                                */
/* 参数说明 ：                                                          */
/*     无                                                               */
/* 返回值 ： true或者false.                                             */
/************************************************************************/
bool LogicUIManager_IsTopWndIdle();

/************************************************************************/
/* 接口  ： LogicUIManager_IsTopWndTalk()                               */
/* 功能  ： 初始化判断顶层窗口是不是Talk                                */
/* 参数说明 ：                                                          */
/*     无                                                               */
/* 返回值 ： true或者false.                                             */
/************************************************************************/
bool LogicUIManager_IsTopWndTalk();

/************************************************************************/
/* 接口  ： LogicUIManager_IsTopWndZero()                               */
/* 功能  ： 初始化判断顶层窗口是不是Talk                                */
/* 参数说明 ：                                                          */
/*     无                                                               */
/* 返回值 ： true或者false.                                             */
/************************************************************************/
bool LogicUIManager_IsTopWndZero();

/************************************************************************/
/* 接口  ： LogicUIManager_IsTopWndXMLBrowser()                          */
/* 功能  ： 初始化判断顶层窗口是不是XMLBrowser                          */
/* 参数说明 ：                                                          */
/*     无                                                               */
/* 返回值 ： true或者false.                                             */
/************************************************************************/
bool LogicUIManager_IsTopWndXMLBrowser();

#endif // __MOD_LOGIC_UI_MANAGER__
