#ifndef __MOD_E911_ADDRESS_H__
#define __MOD_E911_ADDRESS_H__

#if IF_FEATURE_GENBAND_E911
#include "e911address_def.h"

/*******************************************************************
** 函数描述: E911模块初始化
** 参数：    无
** 返回:     无
********************************************************************/
void e911_Init();

/*******************************************************************
** 函数描述: E911请求地址列表
** 参数：    无
** 返回:     请求是否成功
********************************************************************/
bool e911_ReqAddress();

/*******************************************************************
** 函数描述: 获取当前LocationID下面的子节点
** 参数：    nID 当前界面的LocationID
             pData 返回的子节点ID列表
** 返回:     是否获取成功
********************************************************************/
bool e911_GetAddressListData(E911AddressListData* pData, int nID);

/*******************************************************************
** 函数描述: 获取当前LocationID下面的子节点个数
** 参数：    nID 当前界面的LocationID
** 返回:     当前LocationID下面子节点个数
********************************************************************/
int e911_GetAddressListCount(int nID);

/*******************************************************************
** 函数描述: 获取当前LocationID的地址详情信息
** 参数：    nID 当前界面的LocationID
** 返回:     Location地址详情
********************************************************************/
E911AddressData* e911_GetAddressDetailByID(int nID);

/*******************************************************************
** 函数描述:
** 参数：    无
** 返回:     无
********************************************************************/
int e911_GetIDByIndex(int nParentID, int nIndex);

/*******************************************************************
** 函数描述: 获取当前位置信息
** 参数：    无
** 返回:     当前位置信息
********************************************************************/
yl::string e911_GetCurrentLocation();

/*******************************************************************
** 函数描述: 设置当前Location
** 参数：    nID 当前界面的LocationID
             strFullAddr 地址详细列表
** 返回:     是否设置成功
********************************************************************/
bool e911_SetLocationID(int& nID, yl::string& strFullAddr);

/*******************************************************************
** 函数描述: E911模块初始化
** 参数：    nID 当前界面的LocationID
             strFullAddr 地址详细列表
** 返回:     是否获取成功
********************************************************************/
bool e911_GetFullLocationAddr(int& nID, yl::string& strFullAddr);

/*******************************************************************
** 函数描述: 取消地址列表下载
** 参数：    无
** 返回:     无
********************************************************************/
void e911_CancelDownload();

/*******************************************************************
** 函数描述: 清空地址列表
** 参数：    无
** 返回:     无
********************************************************************/
void e911_ClearListData();

/*******************************************************************
** 函数描述: E911 功能是否打开
** 参数：    无
** 返回:     Genband E911 功能是否打开
********************************************************************/
bool e911_IsGenbandE911On();

/*******************************************************************
** 函数描述: 获取该组的parentID
** 参数：    无
** 返回:     ParentID
********************************************************************/
int e911_GetParentIDByID(int nID);

#endif
#endif // __MOD_E911_ADDRESS_H__
