#ifndef __MOD_EMERGENCY_H__
#define __MOD_EMERGENCY_H__

#include "config.h"

/*******************************************************************
** 函数描述:    模块初始化
** 参数：      NA
** 返回:       NA
********************************************************************/
void Emergency_Init();

/*******************************************************************
** 函数描述:   是否为紧急号码(含白名单模式)
** 参数：      [in] cszTarget：号码
** 返回:       无
********************************************************************/
bool Emergency_IsEmergency(const char * cszTarget, bool IsCharCmp = false);

/*******************************************************************
** 函数描述:    是否是紧急来电号码
** 参数：      [in] cszTarget：号码
** 返回:       无
********************************************************************/
bool Emergency_IsIncomingEmergency(const char * cszTarget);

/*******************************************************************
** 函数描述:    是否是紧急转移号码
** 参数：      [in] cszTarget：号码
** 返回:       是否是紧急转移号码
********************************************************************/
bool Emergency_IsForwardEmergency(const char * cszTarget);

/*******************************************************************
** 函数描述:    呼叫紧急号码（以不再使用）
** 参数:      无
** 返回:      无
********************************************************************/
void Emergency_CallEmergency();

/*******************************************************************
** 函数描述:    是否是紧急呼出模式（相对白名单而言）
** 参数：       [in] lpNum：号码
** 返回:        true/false
********************************************************************/
bool Emergency_IsEmergencyMode(LPCSTR lpNum, bool IsCharCmp = false);

/*******************************************************************
** 函数描述:    紧急呼出模式（相对白名单而言）是否可用
** 参数：       void
** 返回:        true/false
********************************************************************/
bool Emergency_IsEmergencyModeEnable();

#ifdef IF_FEATURE_EMERGENCY
/*******************************************************************
** 函数描述:    获取呼出时的服务器优先级（相对白名单而言）
** 参数：       [in] iIndex：号码
** 返回:        服务器优先级
********************************************************************/
yl::string Emergency_GetServerPriority(int iIndex);

/*******************************************************************
** 函数描述:    紧急模式下获取AssertId
** 参数：       NA
** 返回:        以字符串形式返回（非法值 NULL）
********************************************************************/
LPCSTR Emergency_GetAssertId();

/*******************************************************************
** 函数描述:    获取匹配的序号
** 参数：       [in] lpNum：号码
** 返回:        以字符串形式返回（非法值 -1）
********************************************************************/
int Emergency_GetPosIndex(LPCSTR lpNum);
#endif

/*******************************************************************
** 函数描述:    开始进入紧急呼叫窗口期
** 参数：    NA
** 返回：    NA
********************************************************************/
void Emergency_StartWindows();

/*******************************************************************
** 函数描述:    是否接收来电
** 参数：    [in] lpNum：号码
** 返回：    NA
********************************************************************/
bool Emergency_IsAcceptNewCall(LPCSTR lpNum);

/*******************************************************************
** 函数描述：是否支持紧急号码回呼
** 参数：
** 返回：    true/false
********************************************************************/
bool Emergency_IsEnabelEmergencyCalling();
#endif // __MOD_EMERGENCY_H__

