#ifndef __MOD_WIFI_UI_H
#define __MOD_WIFI_UI_H

/************************************************************************/
/* 接口  ： WifiUI_EnterBaseView()                                       */
/* 功能  ： 进入wifi列表界面                                            */
/* 参数说明 ：无                                                        */
/* 返回值 ： 无                                                         */
/************************************************************************/
void WifiUI_EnterBaseView();

#endif
