#ifndef _MOD_EDKUI_H_
#define _MOD_EDKUI_H_
#include "edkui_def.h"
#include <ETLLib.hpp>
#include "uimanager/moduimanager.h"

/************************************************************************/
// 函数描述  ： EdkUI初始化
// 参数说明 ：
// 返回值 ： bool
/************************************************************************/
bool EdkUI_Init();

/************************************************************************/
// 函数描述  ： 通过softkey type查找softkey id
// 参数说明 ： strSoftkeyID:查找的id
// 返回值 ： bool
/************************************************************************/
bool EdkUI_GetSoftkeyIDByType(SoftKey_TYPE eType, yl::string & strSoftkeyID);

/************************************************************************/
// 函数描述  ： 通过menu id查找page name
// 参数说明 ：
// 返回值 ： 查找的page name
/************************************************************************/
yl::string EdkUI_GetPageNameByMenuID(const yl::string & strMenuID);

/************************************************************************/
// 函数描述  ： 通过page data查找menu id
// 参数说明 ：
// 返回值 ： 查找的menu id
/************************************************************************/
yl::string EdkUI_GetMenuIDByPageData(const yl::string & strPageName,
                                     const yl::string & strNextPageName, const int & nID);

/************************************************************************/
// 函数描述  ： 通过menu id查找dir type
// 参数说明 ：
// 返回值 ： 查找的联系人类型
/************************************************************************/
int EdkUI_GetDirTypeByMenuID(const yl::string & strMenuID);

/************************************************************************/
// 函数描述  ： 通过dir type查找menu id
// 参数说明 ：
// 返回值 ： 查找的menu id
/************************************************************************/
yl::string EdkUI_GetMenuIDByDirType(int DirType);

/************************************************************************/
// 函数描述  ： 通过key type查找提示名称
// 参数说明 ： iType[in]:key type, strTipName[out]:提示名,  eType[in]:提示名称类型
// 返回值 ： 查找结果
/************************************************************************/
bool EdkUI_GetKeyTipName(int iType, yl::string & strTipName, TipNameType eType);

/************************************************************************/
// 函数描述  ： 获取页面ID
// 参数说明 ：strMenuID [out]:页面ID, strPageName[in]:页面名称, iDirType[in]联系人页面类型
// 返回值 ： 查找结果
/************************************************************************/
bool EdkUI_GetMenuTipName(yl::string & strMenuID, const yl::string strPageName, int iDirType);

/************************************************************************/
// 函数描述  ： 执行EDK调用的softkey功能
// 参数说明 ：strSoftkeyID [in]:softkey 唯一标识
// 返回值 ： 执行结果
/************************************************************************/
bool EdkUI_OnExcuteSoftkey(const yl::string & strSoftkeyID);

/************************************************************************/
// 函数描述  ： 执行EDK调用的进入菜单功能
// 参数说明 ：strMenuiD [in]:menu 唯一标识, iIndex[in]:预留参数,部分menu进入需要下标
// 返回值 ： 执行结果
/************************************************************************/
bool EdkUI_EnterMenu(const yl::string & strMenuiD, int iIndex = 0);

/************************************************************************/
// 函数描述  ： 通过program key id获取program key type
// 参数说明 ：eType [in]:program key type, strKeyID[out]:program key id
// 返回值 ： 获取结果
/************************************************************************/
bool EdkUI_ProgramkeyIDByType(DssKey_Type eType, yl::string & strKeyID);

/************************************************************************/
// 函数描述: 通过program key type获取program key id
// 参数说明: strKeyID [in]:program key 唯一标识
// 返回值 : program key类型
/************************************************************************/
DssKey_Type EdkUI_ProgramkeyTypeByID(const yl::string & strKeyID);

/************************************************************************/
// 函数描述: 通过menu对应的条件判断函数指针
// 参数说明: pAllowFunc [in]:条件判断函数指针
// 返回值     : program key类型
/************************************************************************/
bool EdkUI_SetAllowEnterUIFunc(FuncIsAllowEnterMenu pAllowFunc,
                               const yl::string & strPageName = "",
                               const int iDirType = 0);

/************************************************************************/
// 功能: edk输入框显示
//  参数: iIndex ：第几个弹出框
//  参数：iId : 第几个edk命令执行的弹出框
//  参数: pFun ：ui响应的回调函数
/************************************************************************/
void EdkUI_ShowEdkPrompt(int iIndex, int iId, FuncEdkActionCallBack pFun);

/************************************************************************/
// 功能: edk刷新当前显示窗口的softkey
// 参数: 无
/************************************************************************/
void EdkUI_UpdateSoftkey();

/************************************************************************/
// 函数描述  ： 打开长按音量+计时器
// 参数说明 ：  无
// 返回值 ： 无
/************************************************************************/
void EdkUI_StartKeyTimer();

/************************************************************************/
// 函数描述  ： 关闭长按音量+计时器
// 参数说明 ：  无
// 返回值 ： 无
/************************************************************************/
void EdkUI_StopKeyTimer();

/************************************************************************/
// 函数描述  ： EdkUI模块设置提示模式
// 参数说明 ： 设置是否提示模式，并刷新UI
// 返回值 ： 无
/************************************************************************/
void EdkUI_SetHintMode(bool bShowMode);

/************************************************************************/
// 函数描述  ： 更新EDK相关的softkey信息
// 参数说明 ： 设置是否提示模式，并刷新UI
// 返回值 ： 无
/************************************************************************/
void EdkUI_GetEDKSoftkeyData(CArraySoftKeyBarData & objSoftkeyData);

#endif  //_MOD_EDKUI_H_
