#ifndef __MOD_HOT_DESKING_H__
#define __MOD_HOT_DESKING_H__

/*******************************************************************
** 函数描述:   UI给Logic发送UI事件
**             [in] lpURL: 高级模式的下载地址,如果该参数为空,则为普通模式
** 返回:       true，成功处理；false，未处理
********************************************************************/
void hotDesking_Enter(LPCSTR lpURL = NULL, int iKeyCode = -1);

/*******************************************************************
** 函数描述:   菜单界面快捷进入接口
**
** 返回:
********************************************************************/
void hotDesking_Menu_Enter();

#ifdef IF_ADVANCE_HOTDESKING
/*******************************************************************
** 函数描述:   判断是否处于高级hotdesking模式
**
** 返回:       TRUE:当前处于高级Hotdesking模式
********************************************************************/
BOOL hotDesking_IsAdvMode();

/*******************************************************************
** 函数描述:        更改Hotdesking当前状态
**              [in] bIsAdvMode: TRUE: 设置高级模式标志 FALSE:取消高级模式标志
** 返回:          无
********************************************************************/
VOID hotDesking_SetAdvMode(BOOL bIsAdvMode);

/*******************************************************************
** 函数描述:   判断是否使用HotDesking的softkey
**
** 返回:       TRUE:使用hotdesking的softkey,否则不使用
********************************************************************/
BOOL hotDesking_UseHotDeskingSoftKey();

/*******************************************************************
** 函数描述:   判断是否处于高级hotdesking模式
**            [in] 按键值
**            [out] 按键对应的名字
** 返回:       无
********************************************************************/
void hotDesking_GetHotDeskingkeyName(int iKeyIndex, yl::string & strKeyName);

/*******************************************************************
** 函数描述:   高级模式下的hotdesking按键处理
**            [in] 按键值
** 返回:       无
********************************************************************/
BOOL hotDesking_OnSoftKey(int iKeyIndex);

/*******************************************************************
** 函数描述:   HotDeskingSoftkey对配置改变的处理
**            [in] objMessage: 配置文件改变的消息
** 返回:       无
********************************************************************/
BOOL hotDesking_OnConfigChange(msgObject & objMessage);

/*******************************************************************
** 函数描述:   HotDeskingSoftkey对sip消息的响应
**            [in] objMessage: sip消息,响应SIP_SUB_HOT_DESKING_NOTIFY
** 返回:       无
********************************************************************/
BOOL hotDesking_OnSipMessage(msgObject & objMessage);
#endif  //IF_ADVANCE_HOTDESKING

/*******************************************************************
** 函数描述:        hotdesking初始化
** 返回:          无
********************************************************************/
VOID hotDesking_Init();

/*******************************************************************
** 函数描述:        检查是否进入hotdesking login wizard
********************************************************************/
BOOL hotDesking_EnterLoginWizard();

/*******************************************************************
** 函数描述:        注册向导是否生效
** 返回:          TRUE:注册向导生效,FALSE:注册向导没生效
********************************************************************/
BOOL hotDesking_IsLogonWizard();

/*******************************************************************
** 函数描述:        清空用户信息
********************************************************************/
VOID hotDesking_ClearUserInfo();

#endif
