#ifndef __MOD_ZERO_H__
#define __MOD_ZERO_H__

#include <ylstring.h>
#include "zero_common.h"

/************************************************************************/
/*  接口:zero_Enter()                                                 */
/*  接口说明: 进入Zero的入口函数                                     */
/*  参数说明: 无参数                                                 */
/*  返回值:  无                                                         */
/************************************************************************/
void zero_Enter(bool bZeroLanuched = false);

/************************************************************************/
// 功能: 进入RPS界面
/************************************************************************/
bool zero_EnterRPS();

/************************************************************************/
// 功能: 网络检测界面
/************************************************************************/
bool zero_CheckingNetwork();

/************************************************************************/
/*  接口:zero_Exit()                                                  */
/*  接口说明: 退出Zero                                                    */
/*  参数说明: 无参数                                                 */
/*  返回值:  无                                                         */
/************************************************************************/
void zero_Exit(bool bExitAutoP = true);

/************************************************************************/
/*  接口:zero_EnterNextStage()                                            */
/*  接口说明: 进入到下一个状态                                          */
/*  参数说明: strCurrentPageAction:当前界面的action                        */
/*            strSoftkeyAction: 当前softkey操作的类型                    */
/*  返回值:  无                                                         */
/************************************************************************/
void zero_EnterNextStage(const yl::string & strCurrentPageAction,
                         const yl::string & strSoftkeyAction);

/************************************************************************/
/*  接口:zero_SetRedirectData()                                           */
/*  接口说明: 设置是否是由UI启动的，把UI的值传入                     */
/*  参数说明: strUserName传入的用户名 strPassword传入的密码          */
/*  返回值:  无                                                         */
/************************************************************************/
void zero_SetRedirectData(const yl::string strUserName, const yl::string strPassword);

#if IF_BUG_30885
bool zero_BeginAutop();
#endif

/************************************************************************/
/*  接口: zero_IsZeroLaunched()                                           */
/*  接口说明: 是否启动zero                                      */
/*  参数说明: 无                                                       */
/*  返回值:  true，启动；false，没启动                           */
/************************************************************************/
bool zero_IsZeroStart();

/************************************************************************/
// 功能: 进入RPS等待界面
/************************************************************************/
bool zero_EnterRPSWaitting();

#endif // __MOD_ZERO_H__
